{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!", "nice"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "service",
      "patterns": [
        "Help",
        "What can I ask?",
        "what can i ask?",
        "what can i ask"
      ],
      "responses": [
        "Hi, please contact 999 for emergency and below is the list of services that are provided: <br>1. Definition of Diabetes, COVID-19 and HIV/AIDS <br>2. Symptoms of Diabetes, COVID-19 and HIV/AIDS <br>3. Prevention of Diabetes, COVID-19 and HIV/AIDS "
        
      ]
    },
    {
      "tag": "definition",
      "patterns": [
        "definition",
        "definition?"
      ],
      "responses": [
        "Hi, please specify which disease <br>1. Diabetes definition <br>2. COVID-19 definition <br>3. HIV/AIDS definition"
      ]
    },
    {
      "tag": "ddefinition",
      "patterns": [
        "Diabetes definition",
        "Diabetes definition?",
        "diabetes definition?",
        "diabetes definition"
      ],
      "responses": [
        "Based on World Health Organisation (WHO), Diabetes is a chronic disease that occurs either when the pancreas does not produce enough insulin or when the body cannot effectively use the insulin it produces. <br>Insulin is a hormone that regulates blood glucose. <br>Hyperglycaemia, also called raised blood glucose or raised blood sugar, is a common effect of uncontrolled diabetes and over time leads to serious damage to many of the body's systems, especially the nerves and blood vessels. <br>There are two types of diabetes which are the type 1 and type 2 diabetes: <br>1. Type 1 diabetes (previously known as insulin-dependent, juvenile or childhood-onset) is characterized by deficient insulin production and requires daily administration of insulin. <br>2. Type 2 diabetes (formerly called non-insulin-dependent, or adult-onset) results from the body’s ineffective use of insulin."
      ]
    },
    {
      "tag": "cdefinition",
      "patterns": [
        "covid definition",
        "COVID definition",
        "covid19 definition",
        "COVID-19 definition?",
        "covid-19 definition?"
      ],
      "responses": [
        "Based on World Health Organisation (WHO), Coronavirus disease (COVID-19) is an infectious disease caused by the SARS-CoV-2 virus. <br>Most people infected with the virus will experience mild to moderate respiratory illness and recover without requiring special treatment. However, some will become seriously ill and require medical attention. Older people and those with underlying medical conditions like cardiovascular disease, diabetes, chronic respiratory disease, or cancer are more likely to develop serious illness. <br>Anyone can get sick with COVID-19 and become seriously ill or die at any age."
      ]
    },
    {
      "tag": "hdefinition",
      "patterns": [
        "hiv definition",
        "aids definition",
        "HIV definition?",
        "AIDS definition?"
      ],
      "responses": [
        "Based on World Health Organisation (WHO), Human immunodeficiency virus (HIV) is an infection that attacks the body’s immune system, specifically the white blood cells called CD4 cells. <br>HIV destroys these CD4 cells, weakening a person’s immunity against opportunistic infections, such as tuberculosis and fungal infections, severe bacterial infections and some cancers."
      ]
    },
    {
      "tag": "symptoms",
      "patterns": [
        "symptoms",
        "symptom"
      ],
      "responses": [
        "Hi, please specify which disease <br>1. Diabetes symptoms <br>2. COVID-19 symptoms <br>3. HIV/AIDS symptoms"
      ]
    },
    {
      "tag": "dsymptoms",
      "patterns": [
        "diabetes symptoms",
        "Diabetes symptoms"
      ],
      "responses": [
        "Common symptoms for diabetes: <br>1. Urinate (pee) a lot, often at night. <br>2. Are very thirsty all the time. <br>3. Lose weight without trying. <br>4. Are very hungry all the time. <br>5. Have numb or tingling hands or feet."
      ]
    },
    {
      "tag": "csymptoms",
      "patterns": [
        "covid symptoms?",
        "COVID symptoms?",
        "covid19 symptoms",
        "COVID-19 symptoms?",
        "covid-19 symptoms"
      ],
      "responses": [
        "Common symptoms for COVID-19: <br>1. Fever <br>2. Cough <br>3. Losing sense of taste and smell <br>4. Fatigue <br>5. Muscle or joint aches"
      ]
    },
    {
      "tag": "hsymptoms",
      "patterns": [
        "hiv symptoms",
        "aids symptoms",
        "HIV symptoms",
        "AIDS symptoms"
      ],
      "responses": [
        "Common symptoms for HIV/AIDS: <br>1. Flu <br>2. Chills <br>3. Cold sweats <br>4. Sore throat <br>5. Constant fatigue"
      ]
    },
    {
      "tag": "prevention",
      "patterns": [
        "prevention?",
        "prevention"
      ],
      "responses": [
        "Please specify prevention for what disease <br>1. Diabetes prevention <br>2. COVID-19 prevention <br>3. HIV/AIDS prevention"
      ]
    },
    {
      "tag": "dprevention",
      "patterns": [
        "diabetes prevention?",
        "Diabetes prevention",
        "Diabetes prevention?",
        "diabetes prevention?"
      ],
      "responses": [
        "Prevention for diabetes: <br>1.  Lose extra weight <br>2. Remain physically active <br>3. Reduce eating unhealthy food"
      ]
    },
    {
      "tag": "cprevention",
      "patterns": [
        "covid-19 prevention?",
        "covid prevention",
        "COVID prevention?",
        "COVID-19 prevention?",
        "COVID-19 prevention",
        "covid-19 prevention"
      ],
      "responses": [
        "Prevention for COVID-19: <br>1. Avoid crowded places <br>2. Wash hands frequently <br>3. Wear a face mask when in public"
      ]
    },
    {
      "tag": "hprevention",
      "patterns": [
        "hiv prevention?",
        "HIV prevention",
        "aids prevention?",
        "AIDS prevention?",
        "HIV/AIDS prevention",
        "hiv/aids prevention?"
      ],
      "responses": [
        "Prevention for HIV/AIDS: <br>1. Avoid sharing razors <br>2. Use condom during sex <br>3. Always use sterile needles"
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    }
  ]
}
